In [2]:
import warnings
import textwrap
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.patches as patches
import statsmodels.api as sm
import statsmodels.formula.api as smf
import numpy
from matplotlib import pyplot, transforms
from matplotlib.text import OffsetFrom

In [3]:
df = pd.read_csv('./data/kaggle_survey_2022_responses.csv', skiprows=[0])

/var/folders/4c/6jy3z6sn7zg_n_24fwj6v_xw0000gn/T/ipykernel_74238/2989873918.py:1: DtypeWarning: Columns (208,225,255,257,260,270,271,277) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('./data/kaggle_survey_2022_responses.csv', skiprows=[0])

# Data cleaning

## Columns

In [4]:
col_mapping = pd.read_csv('./data/column_mapping.csv')

In [5]:
col_mapping_dict = {k:v for k, v in col_mapping.dropna().values}

In [6]:
df = df[col_mapping_dict.keys()].rename(columns=col_mapping_dict)

## Select data professionalas only

In [7]:
pos_mapping = pd.read_csv('./data/position_mapping.csv')
pos_maping_dict = {k:v for k, v in pos_mapping.dropna().values}

In [8]:
df['title'] = df['title'].map(pos_maping_dict)

In [9]:
df = df.query('student == "No"')

In [10]:
#Drop the column student after filtering to focus on industry insights from professionals
df = df.drop(columns=['student'])
df.head(3)

,age,gender,country,education_level,published,ml_used_theoretical,ml_used_applied,ml_used_no,code_exp,program_lang_Python,...,cloud_platform_GoogleCloudPlatform(GCP),cloud_platform_IBMCloud/RedHat,cloud_platform_OracleCloud,cloud_platform_SAPCloud,cloud_platform_VMwareCloud,cloud_platform_AlibabaCloud,cloud_platform_TencentCloud,cloud_platform_HuaweiCloud,cloud_platform_None,cloud_platform_Other
0,30-34,Man,India,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,30-34,Man,Algeria,Master’s degree,Yes,NaN,NaN,No,1-3 years,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,55-59,Man,France,Some college/university study without earning ...,NaN,NaN,NaN,NaN,10-20 years,Python,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Other

In [11]:
df = df.query('title.notna() and title != "Currently not employed"')

In [12]:
df['title'].unique()

array(['Data Scientist', 'Software Engineer', 'Research Scientist',
       'Other', 'Developer Advocate', 'Data Analyst', 'Data Engineer',
       'ML/MLops Engineer', 'Engineer (non-software)',
       'Teacher/professor', 'Statistician', 'Manager',
       'Data Administrator', 'Data Architect'], dtype=object)

In [13]:
df = df.query('industry.notna()')
df.head(3)

,age,gender,country,education_level,published,ml_used_theoretical,ml_used_applied,ml_used_no,code_exp,program_lang_Python,...,cloud_platform_GoogleCloudPlatform(GCP),cloud_platform_IBMCloud/RedHat,cloud_platform_OracleCloud,cloud_platform_SAPCloud,cloud_platform_VMwareCloud,cloud_platform_AlibabaCloud,cloud_platform_TencentCloud,cloud_platform_HuaweiCloud,cloud_platform_None,cloud_platform_Other
3,55-59,Man,France,Some college/university study without earning ...,NaN,NaN,NaN,NaN,10-20 years,Python,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Other
7,30-34,Man,Germany,Bachelor’s degree,NaN,NaN,NaN,NaN,10-20 years,Python,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,70+,Man,Australia,Doctoral degree,Yes,NaN,"Yes, the research made use of machine learning...",NaN,20+ years,Python,...,Google Cloud Platform (GCP),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
#Plotting the proportions of country 
num_country = df['country'].value_counts()
num_country = num_country.reset_index()
num_country

                                                index  country
0                                               India     2678
1                            United States of America     1586
2                                               Other      579
3                                               Japan      370
4                                              Brazil      315
5                                             Nigeria      168
6                                              France      160
7   United Kingdom of Great Britain and Northern I...      150
8                                               Spain      150
9                                              Mexico      149
10                                        South Korea      145
11                                           Pakistan      144
12                                             Turkey      132
13                                             Canada      126
14                                              China      124
15                                             Taiwan      121
16                                          Indonesia      111
17                                             Russia      111
18                                              Egypt      104
19                                              Italy      103
20                                           Colombia       94
21                                        Netherlands       84
22                                          Argentina       78
23                                             Poland       78
24                                          Australia       66
25                                           Viet Nam       60
26                                            Germany       58
27                               United Arab Emirates       58
28                                           Thailand       56
29                                              Chile       56
30                                         Bangladesh       49
31                                             Israel       49
32                                        Philippines       48
33                                            Morocco       47
34                                           Portugal       46
35                                              Kenya       45
36                                       South Africa       42
37                                               Peru       42
38                                       Saudi Arabia       41
39                                          Singapore       40
40                                            Belgium       37
41                       Iran, Islamic Republic of...       34
42                                     Czech Republic       33
43                                           Ethiopia       33
44                                 Hong Kong (S.A.R.)       32
45                                           Malaysia       31
46                                            Ireland       31
47                                            Ukraine       28
48                                              Ghana       26
49                                          Sri Lanka       26
50                                            Romania       24
51                                            Tunisia       21
52                                           Cameroon       15
53                                           Zimbabwe       14
54                                              Nepal       13
55                                            Ecuador       12
56              I do not wish to disclose my location       12
57                                            Algeria        9

Encode Machine learning stages

In [15]:
df['company_stage'].unique()

array(['We recently started using ML methods (i.e., models in production for less than 2 years)',
       'We have well established ML methods (i.e., models in production for more than 2 years)',
       'We are exploring ML methods (and may one day put a model into production)',
       'I do not know',
       'We use ML methods for generating insights (but do not put working models into production)',
       'No (we do not use ML methods)', nan], dtype=object)

In [16]:
company_stage_dict = {
    'I do not know': -1,
    'No (we do not use ML methods)': 0,
    'We are exploring ML methods (and may one day put a model into production)': 1,
    'We use ML methods for generating insights (but do not put working models into production)': 2,
    'We recently started using ML methods (i.e., models in production for less than 2 years)': 3,
    'We have well established ML methods (i.e., models in production for more than 2 years)': 4
}

In [17]:
df['stage_index'] = df['company_stage'].map(company_stage_dict)

In [18]:
df.to_csv('./data/cleaned_kaggle2022.csv', index=False)

## 1. Gender & Title distribution in different industries

In [19]:
position = df['title'].value_counts()
position = position.reset_index()
position

                      index  title
0            Data Scientist   1913
1              Data Analyst   1513
2         Software Engineer    971
3                   Manager    826
4         Teacher/professor    820
5                     Other    748
6        Research Scientist    590
7         ML/MLops Engineer    562
8   Engineer (non-software)    463
9             Data Engineer    341
10             Statistician    123
11           Data Architect     95
12       Data Administrator     70
13       Developer Advocate     59

In [20]:
position['Group'] = position['index'].where(position['title'] > 100, 'Other')
position

                      index  title                    Group
0            Data Scientist   1913           Data Scientist
1              Data Analyst   1513             Data Analyst
2         Software Engineer    971        Software Engineer
3                   Manager    826                  Manager
4         Teacher/professor    820        Teacher/professor
5                     Other    748                    Other
6        Research Scientist    590       Research Scientist
7         ML/MLops Engineer    562        ML/MLops Engineer
8   Engineer (non-software)    463  Engineer (non-software)
9             Data Engineer    341            Data Engineer
10             Statistician    123             Statistician
11           Data Architect     95                    Other
12       Data Administrator     70                    Other
13       Developer Advocate     59                    Other

In [21]:
group_position = position.groupby('Group')['title'].sum().reset_index().sort_values(by='title', ascending=False)
group_position

                      Group  title
2            Data Scientist   1913
0              Data Analyst   1513
6                     Other    972
8         Software Engineer    971
5                   Manager    826
10        Teacher/professor    820
7        Research Scientist    590
4         ML/MLops Engineer    562
3   Engineer (non-software)    463
1             Data Engineer    341
9              Statistician    123

In [22]:
def plot_positions(group_position, ax):
    labels = group_position['Group']
    sizes = group_position['title']
    colors = ['#A6ABAD','#00587A', '#0073A1', '#00A1E0','#00BCE3','#87CEEB', '#89BCC4', '#9BD3DD', '#A4E0EB']
    
    patches, labels_, percentages = ax.pie(
        sizes, colors=colors,
        wedgeprops={'linewidth': 3.0, 'edgecolor': 'white'},
        textprops={'color': 'white', 'fontweight': 'bold','fontname': "Sans Serif"},
        startangle=90, frame=True,
        autopct="%.2f%%",
        pctdistance=0.85,
    )

    ax.axis('off')

    ax.add_artist(plt.Circle((0, 0), 0.6, color='white', linewidth=0))

    # Adding Title of chart
    ax.set_title('Popular positions from surveyors', fontweight = 'bold', size = 15, fontfamily='serif', ha="center", color="#4d4d4d")

    ax.legend(labels, loc='upper right', bbox_to_anchor=(1.35, 0.75))

In [23]:
# fig, axs = plt.subplots(figsize=(15,9), dpi=400)
# plot_positions(group_position, axs)
# plt.show()

In [24]:
df['count'] = 1

In [25]:
position_order = sorted(df['title'].unique().tolist())
position_order

['Data Administrator',
 'Data Analyst',
 'Data Architect',
 'Data Engineer',
 'Data Scientist',
 'Developer Advocate',
 'Engineer (non-software)',
 'ML/MLops Engineer',
 'Manager',
 'Other',
 'Research Scientist',
 'Software Engineer',
 'Statistician',
 'Teacher/professor']

In [26]:
industry_order = sorted(df['industry'].unique().tolist())
industry_order

['Academics/Education',
 'Accounting/Finance',
 'Broadcasting/Communications',
 'Computers/Technology',
 'Energy/Mining',
 'Government/Public Service',
 'Insurance/Risk Assessment',
 'Manufacturing/Fabrication',
 'Marketing/CRM',
 'Medical/Pharmaceutical',
 'Non-profit/Service',
 'Online Service/Internet-based Services',
 'Other',
 'Retail/Sales',
 'Shipping/Transportation']

In [27]:
data_q5q15 = pd.pivot_table(df, values='count', index=['title'], columns=['industry'], aggfunc=np.sum).fillna(0).astype(int).loc[position_order, industry_order].stack()
data_q5q15_man = pd.pivot_table(df[df['gender']=='Man'], values='count', index=['title'], columns=['industry'], aggfunc=np.sum).fillna(0).astype(int).loc[position_order, industry_order].stack()
data_q5q15_woman = pd.pivot_table(df[df['gender']=='Woman'], values='count', index=['title'], columns=['industry'], aggfunc=np.sum).fillna(0).astype(int).loc[position_order, industry_order].stack()

In [28]:
def drawPieMarker(xs, ys, ratios, sizes, colors, ax):
    markers = []
    previous = 0
    # calculate the points of the pie pieces
    for color, ratio in zip(colors, ratios):
        this = 2 * np.pi * ratio + previous
        x  = [0] + np.cos(np.linspace(previous, this, 30)).tolist() + [0]
        y  = [0] + np.sin(np.linspace(previous, this, 30)).tolist() + [0]
        xy = np.column_stack([x, y])
        previous = this
        markers.append({'marker':xy, 's':np.abs(xy).max()**2*np.array(sizes), 'facecolor':color})

    # scatter each of the pie pieces to create pies
    for marker in markers:
        ax.scatter(xs, ys, **marker, alpha=0.7)

In [29]:
# Define function for marker
# def count_to_size(val):
#     max_sz = 20
#     min_sz = 3
#     return np.sqrt((val - 1) / (80 - 1)) * (max_sz - min_sz) + min_sz

In [107]:
with warnings.catch_warnings():
    warnings.filterwarnings('ignore')
    fig = plt.figure(figsize=(22, 25), dpi=200)

    gs = fig.add_gridspec(5, 5)

    ax_plot = fig.add_subplot(gs[1:4, 0:4]) 
    for q5_idx in position_order[::-1]:
        for q15_idx in industry_order:
            man = data_q5q15_man[q5_idx][q15_idx]
            woman = data_q5q15_woman[q5_idx][q15_idx]
            tot = data_q5q15[q5_idx][q15_idx]
            drawPieMarker([q15_idx],[q5_idx], [man/(man+woman), woman/(man+woman)], [tot*7], ['#1170aa', '#B21807'], ax=ax_plot)

    ax_plot.grid(linewidth=0.2, zorder=0)        

    ax_plot.tick_params(axis='x', labelrotation=90)

    # region Industry
    ax_int = fig.add_subplot(gs[0, :4], sharex=ax_plot) 
    data_q15_woman = df[df['gender']=='Woman']['industry'].value_counts()[industry_order]
    ax_int.bar(data_q15_woman.index, data_q15_woman, width=0.45, alpha=0.7, color='#B21807', label='Female')

    data_q15_man = df[df['gender']=='Man']['industry'].value_counts()[industry_order]
    ax_int.bar(data_q15_man.index, data_q15_man, bottom=data_q15_woman , width=0.45, alpha=0.7, color='#1170aa', label='Male')

    plt.setp(ax_int.get_xticklabels(), visible=False)
    # endregion


    # region Title
    ax_tit = fig.add_subplot(gs[1:4, 4], sharey=ax_plot) 

    data_q5_woman = df[df['gender']=='Woman']['title'].value_counts()[position_order]
    ax_tit.barh(data_q5_woman.index[::-1], data_q5_woman[::-1], height=0.55, alpha=0.7, color='#B21807')

    data_q5_man = df[df['gender']=='Man']['title'].value_counts()[position_order]
    ax_tit.barh(data_q5_man.index[::-1], data_q5_man[::-1], left= data_q5_woman[::-1],height=0.55, alpha=0.7, color='#1170aa')

    plt.setp(ax_tit.get_yticklabels(), visible=False)
    # endregion

    # Spines
    for s in ['top', 'left', 'right', 'bottom']:
        ax_plot.spines[s].set_visible(False)
        ax_int.spines[s].set_visible(False)
        ax_tit.spines[s].set_visible(False)
        

    fig.text(0.6, 0.9, 'Gender & Title distribution by Industry', fontweight='bold', fontfamily='arial', fontsize=35, ha='right', color = '#C41E3A') 
    fig.text(0.6, 0.88, 'Source: Data Professionals - Kaggle Survey 2022', fontweight='light', style= 'italic', fontfamily='arial', fontsize=15, ha='right')

    # Legend
    legend_gender = ax_int.legend(bbox_to_anchor=(1.2, 1.1), fontsize=16, frameon=False, title='Gender', title_fontsize=20)
    legend_count = ax_int.annotate(
        'Count of professionals',
        xy=(0.1, 0.1),
        textcoords=OffsetFrom(legend_gender, (0.5, -0.5)),
        xytext=(0, 0),
        fontsize=20,
        ha='center',
    )

    corner_ax = fig.add_subplot(gs[0, 4], zorder=-1)
    corner_ax.set_axis_off()
    for s in ['top', 'left', 'right', 'bottom']:
        corner_ax.spines[s].set_visible(False)

    ax_count = corner_ax.inset_axes([0, 0, 1, 0.5])
    ax_count.set_axis_off()
    sizes = [50, 100, 200]
    x_coords = [0] * len(sizes)
    y_coords = np.arange(len(sizes))
    ax_count.scatter(x_coords, y_coords, marker='o', s=[size*7 for size in sizes], c='#a3acb9', alpha=0.7)
    ax_count.set_xlim(-0.02, 0.06)
    ax_count.set_ylim(-0.5, 2.5)

    for size, x, y in zip(sizes, x_coords, y_coords):
        ax_count.annotate(str(size), (x + 0.015, y-0.15), fontsize=16)

    plt.savefig('./charts/gender title by industry.png')
    plt.close('all')

## 2. ML in research by data professionals

In [31]:
df = df.query('education_level.notna() and education_level != "I prefer not to answer"')
df['education_level'].unique()

array(['Some college/university study without earning a bachelor’s degree',
       'Bachelor’s degree', 'Doctoral degree', 'Master’s degree',
       'No formal education past high school', 'Professional doctorate'],
      dtype=object)

In [32]:
df['edu_group'] = df['education_level'].where(
    ~df['education_level'].isin(["No formal education past high school", "Some college/university study without earning a bachelor’s degree"]), "Below Bachelor's Degree"
    )

In [33]:
df['edu_group'] = df['edu_group'].where(
    ~df['edu_group'].isin(["Professional doctorate", "Doctoral degree"]), "Above Master's Degree"
    )

In [34]:
df['edu_group'].unique()

array(["Below Bachelor's Degree", 'Bachelor’s degree',
       "Above Master's Degree", 'Master’s degree'], dtype=object)

In [35]:
df_theo = df.query('ml_used_theoretical.notna()').groupby(by='title').count()
df_theo

,age,gender,country,education_level,published,ml_used_theoretical,ml_used_applied,ml_used_no,code_exp,program_lang_Python,...,cloud_platform_SAPCloud,cloud_platform_VMwareCloud,cloud_platform_AlibabaCloud,cloud_platform_TencentCloud,cloud_platform_HuaweiCloud,cloud_platform_None,cloud_platform_Other,stage_index,count,edu_group
title,,,,,,,,,,,,,,,,,,,,,
Data Administrator,3,3,3,3,3,3,1,0,3,2,...,0,0,0,0,0,0,0,3,3,3
Data Analyst,45,45,45,45,45,45,18,0,45,39,...,2,4,2,2,1,8,1,43,45,45
Data Architect,5,5,5,5,5,5,3,0,5,5,...,0,0,0,0,0,1,0,5,5,5
Data Engineer,14,14,14,14,14,14,5,0,14,14,...,1,2,2,1,2,1,0,14,14,14
Data Scientist,185,185,185,185,185,185,95,0,185,178,...,4,3,2,2,0,13,4,180,185,185
Developer Advocate,7,7,7,7,7,7,0,0,7,3,...,1,1,1,1,1,1,0,7,7,7
Engineer (non-software),7,7,7,7,7,7,3,0,7,6,...,0,0,0,0,0,0,0,7,7,7
ML/MLops Engineer,70,70,70,70,70,70,34,0,70,68,...,1,2,2,1,2,1,5,70,70,70
Manager,49,49,49,49,49,49,26,0,49,38,...,0,3,0,0,0,8,3,48,49,49
Other,18,18,18,18,18,18,7,0,18,16,...,0,0,0,0,0,3,1,18,18,18
Research Scientist,142,142,142,142,142,142,81,0,142,127,...,0,5,3,0,1,22,3,141,142,142
Software Engineer,37,37,37,37,37,37,16,0,37,33,...,0,1,2,1,0,3,1,37,37,37
Statistician,11,11,11,11,11,11,2,0,11,9,...,0,1,0,0,0,3,1,11,11,11
Teacher/professor,162,162,162,162,162,162,77,0,162,133,...,1,10,4,1,2,26,3,158,162,162

In [36]:
from pandas.plotting import parallel_coordinates

In [42]:
ml_used_df = df.dropna(subset=['published'], how='all')
title_count = ml_used_df.groupby('title').size()
ml_theoretical = ml_used_df.groupby('title')['ml_used_theoretical'].count()
ml_applied = ml_used_df.groupby('title')['ml_used_applied'].count()
ml_no = ml_used_df.groupby('title')['ml_used_no'].count()
ml_used = pd.concat([title_count, ml_theoretical, ml_applied, ml_no], axis=1)
ml_used = ml_used.rename(columns={0: 'count'}).reset_index()
ml_used = (
    ml_used
    .eval('pct_theoretical = ml_used_theoretical / count * 100')
    .eval('pct_applied = ml_used_applied / count * 100')
    .eval('pct_no= ml_used_no / count * 100')
    .drop(['ml_used_theoretical', 'ml_used_applied', 'ml_used_no', 'count'], axis=1)
)
ml_used

                      title  pct_theoretical  pct_applied     pct_no
0        Data Administrator         9.677419     6.451613   9.677419
1              Data Analyst         5.617978    10.362047  17.602996
2            Data Architect         9.433962    13.207547  13.207547
3             Data Engineer         8.187135    15.204678  15.204678
4            Data Scientist        13.754647    28.252788  17.249071
5        Developer Advocate        30.434783     8.695652  13.043478
6   Engineer (non-software)         2.941176    12.184874  30.672269
7         ML/MLops Engineer        19.073569    30.790191  10.626703
8                   Manager         8.626761    17.957746  17.957746
9                     Other         4.615385     9.230769  25.384615
10       Research Scientist        27.952756    50.984252  24.409449
11        Software Engineer         8.008658    15.367965  17.532468
12             Statistician        12.222222    22.222222  18.888889
13        Teacher/professor        23.275862    40.660920  26.436782

In [108]:
# Plot
plt.figure(figsize=(10,7), dpi= 200)
parallel_coordinates(ml_used, 'title', colormap='tab20')
labels = ['% Theoretical Research', '% Applied Research', '% No Research']

# Lighten borders
plt.gca().spines["top"].set_alpha(0)
plt.gca().spines["bottom"].set_alpha(.3)
plt.gca().spines["right"].set_alpha(0)
plt.gca().spines["left"].set_alpha(.3)

plt.title('Use of Machine Learning in published Research by Title\n', fontsize=15, fontweight='bold', ha='center', fontname = 'arial', color = '#C41E3A')
plt.grid(alpha=0.3)
plt.xticks([0, 1, 2], labels, fontsize=9, fontweight='bold')
plt.yticks(fontsize=9, fontweight='bold')

plt.legend(loc='center left', bbox_to_anchor=(1, 0.5))

plt.savefig('./charts/Use of ML.png')
plt.close('all')